Revit 2024 API
PipePressureDropData.CategoryId Property
 The category id of pipe curves. It will be OST_PipeCurves, OST_FlexPipeCurves, or OST_PlaceHolderPipes.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId CategoryId { get; }
Visual Basic
Public ReadOnly Property CategoryId As ElementId
	Get
Visual C++
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace